{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000003ea057"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Editing HTML Articles "
        ],
        "Category": [
          "Editing"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "TEAM Mentor"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          "Editing HTML Articles "
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "WikiText"
        },
        "Data": [
          "=Editing HTML Articles in Edit Mode=\r\nDouble clicking on an HTML article in “Edit Mode” brings up the built-in WYSIWYG HTML editor. You can click on the “view source icon”   to edit HTML source code. Article metadata, such as title, technology, phase, type and category etc. can also be modified in this editor. See Related Items for more details.\r\n\r\n{{/Image/editinghtml-img1.jpg}}\r\n\r\n=Editing HTML Articles in “View Mode”=\r\nIn “view mode”, article editing can be accomplished by clicking on ether the “Edit WYSIWYG” or “Edit Source” buttons.\r\n\r\n{{/Image/editinghtml-img2.jpg}}\r\n \r\nClicking on “Edit WYSIWING” will bring up the already familiar WYSIWYG editor window. You can click on the “view source icon”   to edit HTML source code. Article metadata, such as title, technology, phase, type and category etc. can also be modified in this editor. See Related Items  for further details.\r\n Save changes to your edits by clicking the “Save Changes” Button. Clicking “View Article” will bring up the article in view mode, however, your changes will not be saved unless you go back to editing the article and click  on “Save Changes”\r\n\r\n{{/Image/editinghtml-img3.jpg}}\r\n \r\nClicking on “Edit Source” will bring up a different HTML source view editor. Here you can modify HTML and change the article data type. Currently HTML and WikiText article data types are supported. \r\n \r\n{{/Image/editinghtml-img4.jpg}}\r\n\r\n=Related Items=\r\nFor more information on Article Metadata see:\\\\\r\n[[00000000-0000-0000-0000-0000002df883|Edit Article Metadata]]\\\\\r\n\r\nFor information on editing HTML articles see:\\\\\r\n[[00000000-0000-0000-0000-0000003ea057|Editing HTML Articles]]\\\\\r\n\r\nFor information on editing WikiText articles see:\\\\\r\n[[00000000-0000-0000-0000-00000079da36|Editing WikiText Articles]]\\\\"
        ]
      }
    ]
  }
}