{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-1535922535",
      "Content_Hash": "1513984744"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000005d8802"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Editing the Default TM 3.6 Configuration"
        ],
        "Category": [
          "Administration"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "TEAM Mentor"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          "Editing the Default Configuration"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "wikitext"
        },
        "Data": [
          "\n\n==Configuration File==\nTo edit TEAM Mentor 3.6 Back-end configuration, go to TBot screen from the main Admin menu and select //Edit TMConfig// from the //Admin - Config// row.\n\nThe interface will show you various configurable options broken down by specific areas.\n\nThe following are some of the settings available in the TM Security section. Settings not mentioned below should not be changed without contacting SI support. Default values of the settings are provided in ():\n\n{{/Image/tmcfg01.jpg}}\n\n**Show Content to Anonymous Users** (true)-  (depreciated, should always be set to false) This setting defines whether or not full articles will be displayed to unauthenticated users.\\\\\n**Show Library to Anonymous Users**(true) - (depreciated, should always be set to false) This setting defines whether or not library structure is displayed to unauthenticated users. In case this is unchecked and  \"Show Content to Anonymous Users\" is disabled, all the user will see is a login screen when accessing TEAM Mentor\\\\\n**SSL Redirect Http to Https** (true)- This setting redirects all non SSL traffic, except for traffic coming from localhost, to SSL port. This ensures all TEAM Mentor traffic is protected using SSL.\\\\\n**New Accounts Enabled** (true)- Activates / Deactivates the user approval workflow. If this is unchecked, all users that sign up will have to be approved by the administrator. See [[00000000-0000-0000-0000-0000001c8add|Managing Users]]\\\\\n**New Accounts Don't Expire**(false) - Specifies if new accounts created by users signing up have an expiration date\\\\\n**Eval Accounts Enabled** (true)- This setting specifies if unauthenticated users will be able to create accounts on the system for Evaluation purposes (only works if ShowContentToAnonymousUsers=false) (note: due to current limitation, if set to \"false\" users are still able to create accounts on the system which will not expire, see [[00000000-0000-0000-0000-0000005d8802|Managing Users for workaround]])\\\\\n**Eval Accounts Days** (15) - This specifies the duration, in days, that self-created account will have read access to the content (only works if ShowContentToAnonymousUsers=false and NewAccountsDon'tExpire=false ). \\\\\n**Default Admin: UserName**(admin)  -  Set this option to define the default administrator user name. This user name will be used to manage TEAM Mentor in the early stages of using it.\\\\\n**Default Admin: Password** (!!tmadmin) -  Set this option to define the default administrator password. This password, together with the default administrator user name, will be used to manage TEAM Mentor in the initial setup stage. It is highly recommended to change the administrator password, using the //\"Change Password\"// link on the UI, right after TEAM Mentor had started for the first time.\\\\\n**Default Admin: Email**( TM_alerts@securityinnovation.com) - Specifies the email address of the \"admin\" account.\\\\\n \n\\\\\n\nThe following are some of the settings available in the TM Setup section. Settings not mentioned below should not be changed without contacting SI support. Default values of the settings are provided in ():\n\n{{/Image/tmcfg02.jpg}}\n\n\n**Xml Libraries Path**(TM_Libraries) This is the path to the library files. This is the location of Lib_UNO library. The value of this property can be either an absolute path or a path relative to the //\"\\Library_Data\\XmlDatabase\"// folder. \\\\\n**EnableGZipForWebServices**(true) - This option enables or disables GZip compression for WebService interaction with TEAM Mentor. GZip compression generally increases performance.\\\\\n\n\\\\\n\nThe following are some of the settings available in the Git section. Settings not mentioned below should not be changed without contacting SI support. Default values of the settings are provided in ():\n\n{{/Image/tmcfg03.jpg}}\n\n**Auto Commit UserData**(false) - Specifies if any changes to //User_Data// directory (including the configuration file) will be automatically saved and versioned using built in Git auto-commit mechanism\n**Auto Commit LibraryData**(false) - Specifies if any changes to the content of the library will be automatically save and versioned using built in Git auto-commit mechanism. \n\n\\\\\n\nFor information on Windows Authentication section see [[6e3221bf-08b8-4de1-bb3b-4edacc85fab6|Active Directory Support]]\n\n{{/Image/tmcfg04.jpg}}\n\n\\\\\n\nAll settings not otherwise available via the GUI are available using the Config File Content Editor, which is displayed at the bottom of the configuration page. Note that the content editor is not synchronized with the GUI and vice versa. Save the settings and reload the page in order for changes to be reflected in both sections.\n\n{{/Image/tmcfg05.jpg}}\n\n\\\\\n\n\n==Secret Configuration File==\nTo edit TEAM Mentor Secret configuration, go to TBot screen from the main Admin menu and select Edit Secret Data from the Admin - Config row. This configuration contains parameters that are sensitive in nature. These include SMTP user accounts and passwords, Git repository user names, and others. These, with the exception of SMTP parameters, should not be edited unless following specific instructions for enabling a feature, or unless directed by SI support staff. \n\n{{/Image/tmcfg06.jpg}}\n\n** Libraries Git** - This is a full git path to a library repository\\\\\n**Rijndael_IV** and **Rijndael_Key** - Are used for encryption technology in TEAM Mentor\\\\\n\nFirebase Config is to be used under supervision of support staff only.\n\n{{/Image/tmcfg07.jpg}}\n\n\nFor SMTP Configuration see [[d0b2bade-6d25-4c61-8ae3-94ae0110f959|Configuring Email]]\n\n{{/Image/tmcfg08.jpg}}\n\n\nAll settings not otherwise available via the GUI are available using the Config File Content Editor, which is displayed at the bottom of the configuration page. Note that the content editor is not synchronized with the GUI and vice versa. Save the settings and reload the page in order for changes to be reflected in both sections.\nThe configuration file is physically located under /\\Library_Data\\XmlDatabase\\User_Data\\TMSecretData.config//  it can be edited by hand if necessary.\n\n{{/Image/tmcfg09.jpg}}\n\n\n\n"
        ]
      }
    ]
  }
}