{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-000000481b9d"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Editing Overview"
        ],
        "Category": [
          "Editing"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "TEAM Mentor"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          "Editing Overview"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "WikiText"
        },
        "Data": [
          "=Editing in TEAM Mentor=\nTEAM Mentor supports flexible update of content and customization based on user needs. While consumption of content is done using TEAM Mentor 4.x Front-end, editing is done using TEAM Mentor 3.6 Back-end. Most editing operations in TEAM Mentor are done using the \"Edit Mode\". This mode is available to users with \"Editor\" or \"Administrator\" roles and allows editing of folders and views. Articles can be edited through \"Edit Mode\" as well. \n\nCurrently Folders and Views in TEAM Mentor 3.6 correspond to left-hand side \"Index\" navigation.   \n\nNote that you MUST publish the data as described in [[a23b465e-5277-4764-8caa-78c4d1f441a4|Publishing Data]] for your edits to become available in TM 4.x front end\\\\\n\n==Editing in View Mode==\nTEAM Mentor offers the flexibility of editing articles without going in and out of \"Edit Mode\". If the logged in user is in \"Administrator\" or \"Editor\" role, articles can be edited by clicking on one of the edit buttons in the article view.  \n\n=HTML, Markdown, and WikiText Article Formats=\nCurrently TEAM Mentor supports HTML, Makrdown and WikiText. Steps for editing an article vary depending on article format. HTML Articles are edited using a WYSIWYG editor (optionally manipulating HTML content). WikiText articles are edited using the WikiCreole language with a WikiCreole. Markdown articles are edited using a Markdown editor capable of showing a live preview. All new articles should be created using Markdown. WikiText and HTML editing is being phased out.\n\n=Access and Logging in=\nPoint your browser to the TEAM Mentor 3.6 Back-End URL obtained from your system administrator. Note this is NOT the URL that you use normally to access TEAM Mentor.\n\nClick on the “Login” link in the upper right corner. The login dialog box will pop up. Enter your user credentials:\n\n{{/Image/editingoverview-img1.jpg}}\n\n=Accessing “Edit Mode”=\nThere are two ways to access the TEAM Mentor \"Edit Mode\":\n\n1) Click the \"Edit Mode\" link in the top right of the main user interface:\n\n{{/Image/editingoverview-img2.jpg}}\n \n2) left-click on the library tree to open up the context menu, and choose the option 'Open Edit Mode':\n\n{{/Image/editingoverview-img3.jpg}} \n\nOnce the \"Edit Mode\" is loaded, a number of buttons should be visible on the Guidance Item's Table (for example: 'Select All', 'Deselect All', 'Delete Guidance Items from Library').  \n\n{{/Image/editingoverview-img4.jpg}}\n\nThe article list pane works the same way in \"Edit Mode\" as in regular mode - folders and views can be navigated via the navigation pane on the left; filters and search strings can be used to narrow down the list in the content list pane. The major difference is that double-clicking an article opens it for editing, rather than for viewing.\n\n=Related Items=\nFor more information on Article Metadata see:\\\\\n[[00000000-0000-0000-0000-0000002df883|Edit Article Metadata]]\\\\\n\nFor information on editing HTML articles see:\\\\\n[[00000000-0000-0000-0000-0000003ea057|Editing HTML Articles]]\\\\\n\nFor information on editing WikiText articles see:\\\\\n[[00000000-0000-0000-0000-00000079da36|Editing WikiText Articles]]\\\\\n"
        ]
      }
    ]
  }
}