{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000002ccdf6"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "What is new in this release?"
        ],
        "Category": [
          "Administration"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "TEAM Mentor"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          "WhatsNew"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "\\\\\n\\\\\n\nAPPLICATION CHANGES\n\n4.0 is a major rewrite of TEAM Mentor under new architecture. This includes:\\\\\n- Simplified, modern, easy to use interface and intuitive design\\\\\n- Focus on making it easy to find answers to security questions\\\\\n- Improved search and filter capability. It algorithmically presents the most relevant articles and allows to further narrow down results with robust filtering\\\\\n- Improved ability to browse content. Users can now browse by subject matter, technology, article type and other keywords. Progressively narrowing down results with selected filters\\\\\n- Main User UI fully written in Node JS. \\\\\n- Main User UI support for all browsers. Including legacy and mobile browsers.\\\\\n- Underlying use of a NoSQL database \\\\\n- Robust integration current editor and admin interfaces\\\\\n\n\\\\\nCONTENT CHANGES\n\n- Content had been re-classified into subject matter areas for easy browsing through the taxonomy\\\\\n- Article filters appropriately changed to making more intuitive to find relevant information\\\\\n- Major clean-up of articles. Removal of articles with too little information\\\\\n- Moved away from multiple library structure. All of the content is now in one well-organized library.\\\\\n\n\\\\\n\nMINIMUM REQUIREMENTS\n\nNote the change in minimum requirements specified here:\n\n\nServer Side Requirements\n\n   * Windows 2012 R2 (64 Bit) with IIS 8.0 or higher\\\\\n   * NET Framework 4.5.1 (You can download this version from http://www.microsoft.com/en-us/download/details.aspx?id=40779 )\\\\\n   * 4GB of RAM\\\\\n   * 4GB of Storage\\\\\n   * SSL Certificate\\\\\n\nPlease note that it may be possible to run TEAM Mentor with less RAM and Storage. However performance does degrade under load and minimal configuration listed above is recommended for production environments. Also note, when connecting to TEAM Mentor on local machine (connecting to \"localhost\") SSL certificate is not required. Self-signed certificate may be used for test environments.\n\n\\\\\n\nClient Side Requirements\n\nThe main client side version code named Flare requires:\n\n* IE11 or higher \\\\\n* Firefox 42 or higher \\\\\n* Chrome 46 or higher \\\\\n* Safari v6.1 and 7.0 on OSX only \\\\\n* Mobile browsers for Android and iOS have experimental support. \\\\\n\nThere is  a fallback version code named Jade. Jade supports all available browsers, including IE8 and Lynx. \n\n\nTM 3.6 Back-end (used for Administration and Editing) supports the following browsers \\\\\n* IE11 or higher \\\\\n* Firefox 42 or higher \\\\\n* Chrome 46 or higher \\\\\n* Safari v6.1 and 7.0 on OSX only \\\\\n"
        ]
      }
    ]
  }
}