{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "-93656796",
      "Content_Hash": "-1468932271"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-0000001a9296"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Using the Filters"
        ],
        "Category": [
          "Reading"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "TEAM Mentor"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          "Using the Filters"
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "To the right of the article list is the list of filters.\r\n\r\nSelecting each filter only shows articles from the list that match a the selected filter. \r\n\r\nSelecting multiple filters shows only the the list of articles that match ALL of the selected filters. \r\n\r\n![](/Image/filters-ng-01.png)\r\n\r\nFilters allow narrowing down the presented article list to help find the most relevant articles. \r\n\r\nSelected filter is shown on the top\" (in red below). \r\n\r\nIcons (indicated with green arrows below) match each filter with an article providing a visual representation on the \"Technology\", \"Phase\" and \"Type\" of the article. \r\n\r\nThe gray numbers to the right of each filter represent the amount of articles, from the current result set, that would be selected if this filter was applied. \r\n\r\n![](/Image/filters-ng-02.png)\r\n\r\nFilter can be removed, by clicking \"X\" next to it. Only one filter can be removed at a time. Removal of the filter returns the set of articles to a state before that filter was applied.\r\n\r\n![](/Image/filters-ng-03.png)\r\n\r\n\r\nFilters are divided into categories for easier organization. \r\n\r\n- The \"Technology\" filter - the technology filter allows the user to display only the articles that pertain to a specific technology. For example Microsoft .NET. _Technology Independent_ filter means that the articles it selects do not belong to a specific technology, and the prescriptions in that guidance can be applied universally. \r\n- The \"Phase\" filter - the phase filter allows the user to select only the articles that apply to a specific software development life-cycle phase.\r\n- The \"Type\" filter - the type filter allows the user to choose what types of articles to display. The most common types are \"Checklists\" and \"Guidelines\". \"Guidelines\" describe how to do something in general terms that should be applicable to most applications, but still specific enough to be implemented. A \"Checklist\" describes how to test if a specific security measure or control has been implemented correctly and how to implement it correctly. Checklists and \"Guidelines\" usually exist in pairs. Other types of articles include: \"Vulnerability\", \"Code Example\", \"How To\",  and \"Principle\"\r\n"
        ]
      }
    ]
  }
}