{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "1334847491",
      "Content_Hash": "-1188817129"
    },
    "Metadata": [
      {
        "Id": [
          "00000000-0000-0000-0000-00000061eb3b"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Jade User Interface Overview"
        ],
        "Category": [
          "User Interface"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "TEAM Mentor"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          ""
        ],
        "Tag": [
          ""
        ],
        "Security_Demand": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "true",
          "DataType": "markdown"
        },
        "Data": [
          "TEAM Mentor provides two main avenues for accessing the vast content we offer. \"Searching and Filtering\", and \"Index Navigation\". Each aiming at providing the answers you are looking for in the least amounts of clicks. The best method to use depends on your goal.\r\n\r\nIf you have a specific question, and know what you are looking for, then simply use the \"search and filter\" .\r\n\r\nIf you are not sure what you are interested in, or simply would like to browse our content, use the \"Index\" directory to go through a list of topics until you find one that deserves your further attention.\r\n\r\n**The Main User Interface Has Two Areas.**\r\n\r\nThe Top Menu. Which provides access to the \"Search\" and \"Index\" functionality, as well as access to this documentation. And the workspace below which changes based on the functionality chose.\r\n\r\n![](/Image/uioverview01.png)\r\n\r\n\r\n**Search Page**\r\n\r\nThe default workspace is the \"Search\" page. Type your queries on the search bar. \r\n\r\n![](/Image/search01.png)\r\n\r\nThe main search page also shows your last three recently viewed articles, the three most popular trending search terms in TEAM Mentor, and the top three articles viewed on the site.\r\n(Note that when you first sign up there will not be any recently viewed articles on the page) \r\n\r\n![](/Image/search02.png)\r\n\r\n\r\n**Search Results Page**\r\n\r\nSearch Results Page displays the list of articles that match your query. The number of articles shown is displayed on top.\r\n\r\nThe articles are numbered based on relevance to your query. \r\n\r\nIcon's next to the articles provide visual queues representing their relationship to a filter. \r\n\r\nThe filters on your right help narrow down the search results. Read more about the filters [here](00000000-0000-0000-0000-0000001a9296)\r\n\r\n![](/Image/search03.png)\r\n\r\n**Index Page**\r\n\r\nThe index page is comprised of 3 main components. The subject matter taxonomy on the left, the filters on the right, and the list of available articles in the middle. \r\n\r\n\r\n![](/Image/index01.png)\r\n\r\n**Article View Page**\r\n\r\nArticle view page provides easy, distraction free, way of reading and understanding the content. Each guidance type has a slightly different format. However, most start by explaining the issue at high level, continue into prescriptive details, include problem and solution examples, and are followed by additional reading references. \r\n\r\nOpen the article view page by clicking on the title of the article on ether \"Search\" or \"Index\" Page. \r\n\r\nGo back to the list by using your browsers \"Back\" button. Some people also prefer to open articles in separate tabs, by right-clicking on the article title and selecting \"Open in new tab\" \r\n\r\n![](/Image/example1-05.png)\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}