{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "f9ee3b74-20ef-4b5e-8fc5-1bb70793a514"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Configuring TEAM Mentor Eclipse Plugin for Fortify"
        ],
        "Category": [
          "Administration"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "Eclipse Plugin"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          "Configuring TEAM Mentor Eclipse Plugin for Fortify"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "Currently the following configuration options are available.  These are accessed by clicking on TEAM Mentor->Open Properties page \\\\ \\\\ \r\n{{/Image/eccfg1.jpg}} \\\\ \\\\ \\\\\r\n\r\n**TEAM Mentor Server:\r\n\r\nIs the TEAM Mentor instance where the guidance articles are fetched from. Default is //https://vulnerabilities.TEAMMentor.net//\r\n\r\n**User name: \r\n\r\nThe username on the TEAM Mentor server that you want to link this plugin to \r\n\r\n**Password: \r\n\r\nThe password for the username above \r\n\r\n**SSO Token: \r\n\r\nIf you have purchased the plugin with the SSO configuration to a TEAM Mentor server this will be provided to you instead of the Username and Password.  Note that if you have chosen to purchase the plugin with a pre-configuration option, this is used to access your TEAM Mentor Server; however you do not need to change any configuration yourself. \r\n\r\n**SessionID: \r\n\r\nThis is the session ID that is used for connection to the TEAM Mentor server. This is provided for support information only. \r\n\r\n\\\\\r\n\r\n==Other configuration options:\r\n\r\nOther configuration options are available by expanding the TEAM Mentor Preferences and selecting “Config” \\\\ \\\\\r\n{{/Image/eccfg5.jpg}} \\\\ \\\\ \r\n\r\n**Open TEAM Mentor article in new window: \r\n\r\nThis controls whether each subsequent article will be opened in the same TEAM Mentor window or will be opened in the new window. Default is to open in the same window for easier usability.\r\n\r\n**Load Plugin on Startup:\r\n\r\nThis controls if TEAM Mentor plugin is loaded on Eclipse startup. Note that you must restart Eclipse for changes to take effect.\r\n\r\n**Show Advanced Mode Features:\r\n\r\nThis will make advanced mode features available on TEAM Mentor menu.  These are used for debugging and scripting purposes and are out of scope of this document.\r\n\r\n\r\n\r\n\r\n"
        ]
      }
    ]
  }
}