{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "fa3888bd-c6d0-4f51-a4d1-0470794140b2"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Installation of TEAM Mentor 3.6 Back-end"
        ],
        "Category": [
          ""
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          ""
        ],
        "Type": [
          ""
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "#### Install and configure IIS (if not already installed)\r\n\r\n- Use the Windows Role Manager to install the HTTPS Server role.  \r\n- Select ASP.NET 4.5 as an additional feature under .NET 4.5 Framework. \r\n\r\n![](/Image/install02.png)\r\n\r\n![](/Image/install03.png)\r\n\r\n#### Add TEAM Mentor as a site in IIS.\r\n- Open the \"Internet Information Services (IIS) Manager\". \r\n- Navigate to the \"Sites\" folder in the \"Connections\" tree on the left. \r\n- Right click on the \"Sites\" folder.\r\n- Select \"Add Web Site...” An \"Add Web Site\" window should appear. \r\n- Enter a name for the site in the \"Site name:\" text box. \r\n- Click the \"...\" next to the \"Physical path:\" text box to set the root of the web site. A \"Browse for Folder\" window should appear. \r\n- Select to the \"TM36\\TeamMentor\\Publish\\Website.3.5\" folder inside the TEAM Mentor root folder you unzipped\r\n- Enter the hostname that TM36 will be accessible as. \r\n- Click \"Ok\". Set the port in the \"Port:\" text box, if necessary. \r\n- Click \"OK\".\r\n- The \"Add Web Site\" window should close and a new web site should appear in the \"Sites\" folder in the tree on the left of the \"Internet Information Services (IIS) Manager\" window.\r\n- A new web site should appear in the tree structure on the left of the \"Internet Information Services (IIS) Manager\" window.\r\n \r\n#### Set up SSL.\r\n SSL is enabled by default for TEAM Mentor. Therefore it is necessary to set up SSL certificate. (Note: It is possible to disable SSL configuration)\r\n \r\nFirst generate a CSR\r\n\r\n- Open the \"Internet Information Services (IIS) Manager\". \r\n- Double click on the \"Server Certificates\" menu in the \"Security\" section\r\n- From the \"Actions\" menu click on \"Create Certificate Request.\"\r\n- Follow the Wizzard to create the CSR\r\n- Send the CSR to your Certificate Authority for Signing\r\n\r\nInstall your certificate\r\n\r\n- Open the \"Internet Information Services (IIS) Manager\".\r\n- Double click on the \"Server Certificates\" menu in the \"Security\" section\r\n- From the \"Actions\" menu click on \"Complete Certificate Request.\r\n- \"Browse\" for your SSL Certificate file received from the Certificate Authority, then Click Next. Follow the rest of the wizard steps until finished.\r\n- Now assign the certificate to the newly created web site. Under \"Sites\" Select the web site\r\n- From the \"action menu\" click on \"Bindings\"\r\n- Click \"Add\" in the window that just poped up\r\n- Under \"type\" choose 'https’\r\n- Select the certificate you just imported.\r\n- Under “hostname” type the name URL that this site will be accessible as using HTTPS. (Note that TM40 will connect to TM36 via this URL)  \r\n- The SSL Certificate should be the certificate you just installed.\r\n- Click OK\r\n\r\n#### Set up Permissions\r\nFind the account used by IIS needs to have full control privileges to the TEAM Mentor Library_Data folder\r\n\r\nOn IIS 8 the application account name is the same as Application Pool name. This is the Windows user account used by the IIS Application Pool configured on the TEAM Mentor website.\r\n\r\n- On the \"Internet Information Services (IIS) Manager\".\r\n- Navigate to \"Application Pools\" in the tree on the left\r\n- Find the Application Pool name, it will be the same as the \"Site Name\" you have created in step 3 above.\r\n- Make sure that the .NET Framework version is set to v4.0. Otherwise double click on the Application Pool and set the correct version\r\n- Take a note of the Application Pool name.\r\n- Adjust the file-system permissions. Give full control permissions for the following folders to the Windows user account that is used to run TEAM Mentor. This is the username that has been discovered in the previous step. \r\n* “\\TM36\\Library_Data”\r\n* \"\\TM40\\TM\\data\"\r\n* \"\\TM40\\TM\\code\\TM_Graph\\.tmCache\"\r\n\r\nTo do this, for each of the folders \r\n\r\n    - Right click on the folder\r\n    - Select \"Properties\". A \"Properties\" window should appear. \r\n    - Select the \"Security\" tab in the \"Properties\" window..\r\n    - Give \"Full Control\" to the account IIS AppPool\\<AppPoolName> where the AppPoolName is the name identified above.\r\n    - Click \"OK\"\r\n\r\n#### Configure the TM36 Backend\r\n\r\nLogin to TM36 Backend using the URL you’ve specified in the installation step. (Make sure the URL resolves via DNS). Use an account with admin privileges. Refer to release notes for default admin account information. \r\n\r\n- Click on ```Tbot``` in the upper right corner. \r\n- Select ```Edit Secret Data```\r\n- Enter your SMPT Server information in the appropriate field.\r\n- Enter the URL of your *TM40* installation in “TEAM Mentor Server URL”\r\n\r\nContinue by going through [Installation of TEAM Mentor 4.0](0a27b133-4b24-40ed-98b1-6ac7f35da716)\r\n"
        ]
      }
    ]
  }
}