{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "70197456-9d4c-4bac-8124-a96f7456ea9b"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "Browsing Guidance"
        ],
        "Category": [
          "Reading"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "TEAM Mentor"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          ""
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "markdown"
        },
        "Data": [
          "You may simply use the UI to browse and filter all the guidance items by using left-hand navigation and right-hand filters. This is useful when you would like to discover the information we have.  \r\n\r\nStart  by ether selecting a subject of interest on the left, or a filter on the right. You may continue to select ether filters or subjects of interest until you find a list of articles that you would like to read. Then simply open the article by clicking on its title.\r\n\r\nGo back to the list by using your browsers \"Back\" button.\r\n\r\nSome people also prefer to open articles in separate tabs, by right-clicking on the article title and selecting \"Open in new tab\"\r\n\r\nNumbers next to each subject on the left represent the number of articles that exists for that subject. When you select a subject of interest. You drill down further into specific sub-topics in that subject. Narrowing down the list of articles. Bread crumb navigation on top, shows exactly where you are in the taxonomy\r\n\r\n![](/Image/index-ng-02.png)\r\n\r\n![](/Image/index-ng-03.png)\r\n\r\n![](/Image/index-ng-04.png)\r\n\r\nAt any time you may select a filter on the right to narrow down the displayed list of articles further. Numbers next to the filter represent the number of articles this filter selects. \r\n\r\n![](/Image/index-ng-05.png)\r\n\r\n\r\n![](/Image/index-ng-06.png)\r\n\r\n\r\n\r\nYou may also start your navigation with selecting one or more filter. Once selected, subject directory on the left updates, showing only available topics for the filter(s) \r\n\r\n![](/Image/index-ng-07.png)\r\n\r\n\r\n"
        ]
      }
    ]
  }
}