{
  "TeamMentor_Article": {
    "$": {
      "Metadata_Hash": "0",
      "Content_Hash": "0"
    },
    "Metadata": [
      {
        "Id": [
          "95fc4945-6916-4fcc-9cdb-56aced23d1b0"
        ],
        "Library_Id": [
          "eb39d862-f752-4d1c-ab6e-14ed697397c0"
        ],
        "Title": [
          "How to Evaluate and What to Expect"
        ],
        "Category": [
          "User Guide"
        ],
        "Phase": [
          "NA"
        ],
        "Technology": [
          "HP Fortify SCA UI Integration"
        ],
        "Type": [
          "Documentation"
        ],
        "DirectLink": [
          "How to Evaluate and What to Expect"
        ],
        "Author": [
          ""
        ],
        "Priority": [
          ""
        ],
        "Status": [
          ""
        ]
      }
    ],
    "Content": [
      {
        "$": {
          "Sanitized": "false",
          "DataType": "wikitext"
        },
        "Data": [
          "Evaluate the TEAM Mentor Fortify SCA UI Integration by installing it on your environment and using it with your applications.\n\nUse the guidance to help you build secure software.  The content, through hyperlinks, points to further content available on www.TEAMMentor.net. When you click on such a link you will see a login prompt. If you already have user account on www.TEAMMentor.net, feel free to login and use the content. \n\nIf you don’t have an account at www.TEAMMentor.net speak with your Security Innovation sales rep or your TEAM Mentor administrator to get an account.\n\nAlternatively, you can also sign up for a free 30 day account on the main TEAM Mentor page\n\n**What if we don’t have guidance for a particular finding? **\n\nSome Fortify findings do not have associated TEAM Mentor guidance.  In this case you will not see “Custom Explanation” and “Custom Recommendation” provided by TEAM Mentor. You will see regular Fortify provided guidance.\n\n**Reports in PDF**\n\nBecause our Custom Guidance uses hyperlinks, and HP Fortify PDF rendering engine does not interpret hyperlinks in custom content very well. You may see raw HTML characters when you generate a PDF report. \n\n"
        ]
      }
    ]
  }
}